In [1]:
import pandas as pd
import numpy as np
from sklearn.metrics import r2_score, mean_squared_error
import dtale

In [2]:
df = pd.read_csv('car-mpg_students.csv')
df.head()

,mpg,cyl,disp,hp,wt,acc,yr,origin,car_type,car_name
0,18.0,8,307.0,130,3504,12.0,70,1,0,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,0,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,0,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,0,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,0,ford torino

In [3]:
dups = df.duplicated()
dups.sum()

0

In [4]:
df = df.drop('car_name', axis = 1)

In [5]:
df.head()

    mpg  cyl   disp   hp    wt   acc  yr  origin  car_type
0  18.0    8  307.0  130  3504  12.0  70       1         0
1  15.0    8  350.0  165  3693  11.5  70       1         0
2  18.0    8  318.0  150  3436  11.0  70       1         0
3  16.0    8  304.0  150  3433  12.0  70       1         0
4  17.0    8  302.0  140  3449  10.5  70       1         0

In [6]:
df.head()

    mpg  cyl   disp   hp    wt   acc  yr  origin  car_type
0  18.0    8  307.0  130  3504  12.0  70       1         0
1  15.0    8  350.0  165  3693  11.5  70       1         0
2  18.0    8  318.0  150  3436  11.0  70       1         0
3  16.0    8  304.0  150  3433  12.0  70       1         0
4  17.0    8  302.0  140  3449  10.5  70       1         0

In [7]:
x = df.drop('mpg', axis=1)

In [8]:
x.head()

   cyl   disp   hp    wt   acc  yr  origin  car_type
0    8  307.0  130  3504  12.0  70       1         0
1    8  350.0  165  3693  11.5  70       1         0
2    8  318.0  150  3436  11.0  70       1         0
3    8  304.0  150  3433  12.0  70       1         0
4    8  302.0  140  3449  10.5  70       1         0

In [9]:
y = df['mpg']

In [10]:
y.head()

0    18.0
1    15.0
2    18.0
3    16.0
4    17.0
Name: mpg, dtype: float64

In [11]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [12]:
x_train, x_test, y_train, y_test = train_test_split(x,y, test_size = 0.3, random_state= 20)

In [13]:
regression_model = LinearRegression()
regression_model.fit(x_train,y_train)

LinearRegression()

In [14]:
#Evaluation
pred = regression_model.predict(x_test)

In [15]:
pred

array([15.73854137, 19.15572053, 32.03865828, 18.92106835, 19.74436868,
       16.14416322, 19.48583194, 14.28209578, 31.27457671, 20.44566607,
       32.00868489, 19.02892486,  9.73162135, 22.93416479, 15.58892492,
       23.37597977, 26.05552779, 30.1251735 , 30.29590437, 13.11070868,
       34.45323725, 14.91087219, 35.40866432, 11.94914172, 10.03880671,
       18.96018527, 18.43572621, 19.51670743, 28.04177947, 18.86942911,
       30.38498713, 27.62216574, 23.48128326, 17.73900759, 18.36897927,
       19.95067471, 29.95558976, 33.25148029, 33.51223605, 17.86154782,
       28.1016577 , 34.45795768, 30.23510435, 26.31684933, 35.00694107,
       31.6496338 , 25.42318589, 30.17335784, 35.42433976, 24.01537735,
        8.23123826, 29.02111993, 17.58524454, 26.33477961, 26.72916303,
       12.7620022 , 26.24129606, 36.0714107 , 26.83243109, 28.71179844,
       32.03499429, 33.4133272 , 30.32896255, 12.43055487, 36.32654824,
       29.39971606, 27.8118985 , 26.47877415, 22.35695827, 23.68733993,
       29.58444465, 30.18538387, 35.65046811, 18.20510104, 29.20053915,
       29.1462392 , 34.24756417, 30.00521111,  8.62444583, 31.5249173 ,
        8.4798802 , 34.17135312, 11.9017475 , 24.32175876, 30.15166621,
       26.29137949,  9.21720706, 16.49856807, 16.46455847, 18.74728574,
       25.64048674, 15.39231846, 32.11869188, 30.73701142, 31.0347263 ,
       35.11965169, 30.3210438 , 24.36090871, 32.19218506, 29.48473463,
       18.77914341, 29.92839811, 27.91866637, 18.11460899, 25.29341758,
       17.73220784, 26.17419601, 12.34192003, 24.13939438, 14.8806354 ,
        9.65649952, 21.87983687, 18.96790955, 27.35907412, 33.65316804,
       17.53472701, 21.2064686 , 22.09060775, 15.51940147, 28.02262727])

In [16]:
r2_score(y_test,pred)

0.8249576261630716

In [17]:
k = mean_squared_error(y_test,pred)

In [18]:
rmse = math.sqrt(k)

NameError: name 'math' is not defined

In [ ]:
rmse